app/Controllers/Commentapi.php

    public function index()
    {
        $db = db_connect();
        $itemId = session()->get('current_item');
        $this->model->join('user_data', 'user_data.user_id=comments.user_id');
        $this->model->join('image_data', 'image_data.img_id=user_data.img_id');
        $this->model->join('comment_replies as cr', 'cr.comment_ids = comments.comment_id', 'LEFT');
        $this->model->where('item_id', $itemId);
        $this->model->orderBy('comment_id', 'DESC');
        $username = session()->get('username');
        $result = $db->query("SELECT rank FROM user_data WHERE username='$username' ");
        $rank = $result->getResult('array');
        return $this->respond([
            'respond' => $this->model->findAll(),
            'username' => session()->get('username'),
            'status' => $rank,
            'ses' => session_status(),
        ]);
---
SELECT *
FROM `comments`
JOIN `user_data` ON `user_data`.`user_id`=`comments`.`user_id`
JOIN `image_data` ON `image_data`.`img_id`=`user_data`.`img_id`
LEFT JOIN `comment_replies` as `cr` ON `cr`.`comment_ids` = `comments`.`comment_id`
WHERE `item_id` = '26'
ORDER BY `comment_id` DESC

    public function delete($id = null)
    {
        $comment_id = $id;
        $this->model->where('comment_id', $comment_id);
        $this->model->delete();
---
DELETE FROM `comments`
WHERE `comment_id` = '29'