app/Controllers/Itemsapi.php

    public function index()
    {
        $apiKey = $this->request->getVar('apiKey');
        if ($apiKey != 'tesApiKey') {
            return $this->fail('Wrong API key');
        }
        $this->model->join('likes', 'likes.item_id = items.item_id', 'left');
        $this->model->join('category', 'category.category_id = items.category_id', 'left');
        $this->model->join('collections', 'collections.collection_id = items.collection_id', 'left');
        $this->model->select('items.*, category.*, collections.*')->selectCount('likes.item_id', 'total_like')->groupBy('items.item_id');
        $this->model->orderBy('item_name', 'ASC');
        return $this->respond([
            'Response' => 'success',
            'items' => $this->model->findAll(),
        ]);
---
SELECT `items`.*, `category`.*, `collections`.*, COUNT(`likes`.`item_id`) AS `total_like`
FROM `items`
LEFT JOIN `likes` ON `likes`.`item_id` = `items`.`item_id`
JOIN `category` ON `category`.`category_id` = `items`.`category_id`
JOIN `collections` ON `collections`.`collection_id` = `items`.`collection_id`
GROUP BY `items`.`item_id`
SELECT `items`.*, `category`.*, `collections`.*, COUNT(`likes`.`item_id`) AS `total_like`
FROM `items`
LEFT JOIN `likes` ON `likes`.`item_id` = `items`.`item_id`
LEFT JOIN `category` ON `category`.`category_id` = `items`.`category_id`
LEFT JOIN `collections` ON `collections`.`collection_id` = `items`.`collection_id`
GROUP BY `items`.`item_id`

    public function show($id = null)
    {
        if ($id == 'getCategory') {

            $categoryModel = model('App\Models\CategoryModel');
            return $this->respond([
                'status' => 'Success',
                'category' => $categoryModel->findAll(),
            ]);
        }
        if ($id == 'getCollection') {

            $collectionModel = model('App\Models\CollectionsModel');
            return $this->respond([
                'status' => 'Success',
                'collection' => $collectionModel->findAll(),
            ]);
        }
        if ($id == 'allCollection') {
            $colModel = model('App\Models\CollectionsModel');
            return $this->respond([
                'status' => 'Success',
                'Response' => $colModel->findAll(),
            ]);
        }
        if ($id == 'getLikes') {
            $element = $this->request->getVar('elements');
            $likesModel = model('App\Models\LikesModel');
            $likesModel->join('user_data', 'user_data.user_id = likes.user_id');
            $statusFinal = $likesModel->where('likes.item_id', $element)->findAll();

            return $this->respond([
                'status' => 'success',
                'table' => $likesModel->findAll(),
                'username' => session()->get('username'),
                'Like_Status' => $statusFinal,


            ]);
---
SELECT *
FROM `collections`
SELECT *
FROM `likes`
JOIN `user_data` ON `user_data`.`user_id` = `likes`.`user_id`
WHERE `likes`.`item_id` = '34'
SELECT *
FROM `likes`

            $likesModel->join('items', 'items.item_id = likes.item_id');
            $likesModel->where('item_name', $element);
            $final = $likesModel->where('username', $username);
            if ($final->findAll() != null) {
---
SELECT *
FROM `likes`